#### Terraform Format and Style - `success`
#### Terraform Initialization - `success`
#### Terraform Plan - `success`          

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.remote["connectivity"]: Reading...
data.terraform_remote_state.remote["current"]: Reading...
module.landingzone.azurecaf_name.peering["hub_to_spoke"]: Refreshing state... [id=ljnidnpkuqyugxmo]
module.landingzone.azurecaf_name.peering["spoke_to_hub"]: Refreshing state... [id=wfodqjnlwnvattod]
module.landingzone.module.container_registry["acr1"].azurecaf_name.acr: Refreshing state... [id=wuvhasburhfjlufr]
module.landingzone.module.managed_identities["nonprodapp_mi"].azurecaf_name.msi: Refreshing state... [id=dobkqxjojvsidwhl]
module.landingzone.module.resource_groups["nonprod-rg"].azurecaf_name.rg: Refreshing state... [id=gpseankswihpxyxk]
data.terraform_remote_state.remote["connectivity"]: Read complete after 1s
data.terraform_remote_state.remote["current"]: Read complete after 2s
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2023-04-17 07:23:51.507062323 +0000 UTC]
module.landingzone.data.azurerm_subscription.primary: Reading...
module.landingzone.data.azurerm_client_config.current: Reading...
module.landingzone.data.azurerm_client_config.current: Read complete after 0s [id=2023-04-17 07:23:53.252987461 +0000 UTC]
module.landingzone.module.resource_groups["nonprod-rg"].azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Reading...
module.landingzone.data.azurerm_subscription.primary: Read complete after 0s [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Read complete after 0s [id=2b3020e2-22c9-4b01-b88e-95624dbd2f23]
module.landingzone.module.managed_identities["nonprodapp_mi"].azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dvt_db_mi]
module.landingzone.module.networking["spoke_re1"].azurecaf_name.caf_name_vnet: Refreshing state... [id=cnxbdhkeljiaghtj]
module.landingzone.module.networking["spoke_re1"].module.subnets["aks_nodepool_system"].azurecaf_name.subnet: Refreshing state... [id=lfpfykohmwyfuxwe]
module.landingzone.module.networking["spoke_re1"].module.subnets["private_endpoints"].azurecaf_name.subnet: Refreshing state... [id=hghjrkyhgyhdpywl]
module.landingzone.module.networking["spoke_re1"].module.nsg.azurecaf_name.nsg_obj["aks_nodepool_system"]: Refreshing state... [id=eoutyjmqlmcjdwbx]
module.landingzone.module.networking["spoke_re1"].azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks]
module.landingzone.module.networking["spoke_re1"].module.nsg.azurerm_network_security_group.nsg_obj["aks_nodepool_system"]: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/aks_nodepool_system]
module.landingzone.module.networking["spoke_re1"].module.subnets["aks_nodepool_system"].azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/subnets/aks_nodepool_system]
module.landingzone.module.networking["spoke_re1"].module.subnets["private_endpoints"].azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/subnets/private_endpoints]
module.landingzone.module.managed_identities["nonprodapp_mi"].time_sleep.propagate_to_azuread: Refreshing state... [id=2023-03-23T09:52:13Z]
module.landingzone.module.networking["spoke_re1"].azurerm_subnet_network_security_group_association.nsg_vnet_association["aks_nodepool_system"]: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/subnets/aks_nodepool_system]
module.landingzone.azurerm_virtual_network_peering.peering["hub_to_spoke"]: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg/providers/Microsoft.Network/virtualNetworks/dvt-vnet-hub/virtualNetworkPeerings/hub_to_spoke]
module.landingzone.azurerm_virtual_network_peering.peering["spoke_to_hub"]: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/virtualNetworkPeerings/spoke_to_hub]
module.landingzone.module.container_registry["acr1"].azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.ContainerRegistry/registries/dvtnonprodacr]
module.landingzone.module.aks_clusters["aks_nonprod"].random_string.prefix: Refreshing state... [id=zxspfrdayq]
module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.aks: Refreshing state... [id=havitvswpvpddgkh]
module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.rg_node: Refreshing state... [id=wtlovmwmiijljhrw]
module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.default_node_pool: Refreshing state... [id=dctkjohvoqaysceh]
module.landingzone.module.aks_clusters["aks_nonprod"].azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.ContainerService/managedClusters/akscluster-re1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.landingzone.module.keyvaults["kv1"].azurecaf_name.keyvault will be created
  + resource "azurecaf_name" "keyvault" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "nonprodkeyvault"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_key_vault"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.keyvaults["kv1"].azurerm_key_vault.keyvault will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "westeurope"
      + name                            = (known after apply)
      + purge_protection_enabled        = false
      + resource_group_name             = "app-nonprod-rg"
      + sku_name                        = "standard"
      + soft_delete_enabled             = (known after apply)
      + soft_delete_retention_days      = 7
      + tenant_id                       = "95f1c0e9-c50b-4882-87de-bb2470f0d5ad"
      + vault_uri                       = (known after apply)

      + timeouts {
          + delete = "60m"
        }
    }

  # module.landingzone.module.mssql_databases["mssql_db1"].azurecaf_name.mssqldb will be created
  + resource "azurecaf_name" "mssqldb" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "exampledb1"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_mssql_database"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.mssql_databases["mssql_db1"].azurerm_mssql_database.mssqldb will be created
  + resource "azurerm_mssql_database" "mssqldb" {
      + auto_pause_delay_in_minutes = (known after apply)
      + collation                   = (known after apply)
      + create_mode                 = "Default"
      + creation_source_database_id = (known after apply)
      + extended_auditing_policy    = (known after apply)
      + geo_backup_enabled          = true
      + id                          = (known after apply)
      + license_type                = "LicenseIncluded"
      + max_size_gb                 = 4
      + min_capacity                = (known after apply)
      + name                        = (known after apply)
      + read_replica_count          = (known after apply)
      + read_scale                  = (known after apply)
      + restore_point_in_time       = (known after apply)
      + sample_name                 = (known after apply)
      + server_id                   = (known after apply)
      + sku_name                    = "BC_Gen5_2"
      + storage_account_type        = "GRS"
      + tags                        = {
          + "module" = "mssql_database"
        }
      + zone_redundant              = (known after apply)
    }

  # module.landingzone.module.mssql_servers["mssqlserver1"].azurecaf_name.mssql will be created
  + resource "azurecaf_name" "mssql" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "nonprod-mssqlserver"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_sql_server"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.mssql_servers["mssqlserver1"].azurerm_key_vault_secret.sql_admin_password[0] will be created
  + resource "azurerm_key_vault_secret" "sql_admin_password" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.landingzone.module.mssql_servers["mssqlserver1"].azurerm_mssql_server.mssql will be created
  + resource "azurerm_mssql_server" "mssql" {
      + administrator_login                  = "sqluseradmin"
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + extended_auditing_policy             = (known after apply)
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "westeurope"
      + name                                 = (known after apply)
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "app-nonprod-rg"
      + restorable_dropped_database_ids      = (known after apply)
      + tags                                 = {
          + "module" = "mssql_server"
        }
      + version                              = "12.0"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.landingzone.module.mssql_servers["mssqlserver1"].random_password.sql_admin[0] will be created
  + resource "random_password" "sql_admin" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 128
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "$#%"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.landingzone.module.keyvaults["kv1"].module.initial_policy[0].module.logged_in_aad_app["logged_in_aad_app"].azurerm_key_vault_access_policy.policy will be created
  + resource "azurerm_key_vault_access_policy" "policy" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "2b3020e2-22c9-4b01-b88e-95624dbd2f23"
      + secret_permissions = [
          + "Set",
          + "Get",
          + "List",
          + "Delete",
          + "Recover",
        ]
      + tenant_id          = "95f1c0e9-c50b-4882-87de-bb2470f0d5ad"

      + timeouts {
          + delete = "60m"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ objects         = (sensitive value)

Warning: Argument is deprecated

  with module.landingzone.module.api_management_custom_domain.azurerm_api_management_custom_domain.apim,
  on ../dvt-caf/modules/apim/api_management_custom_domain/module.tf line 1, in resource "azurerm_api_management_custom_domain" "apim":
   1: resource "azurerm_api_management_custom_domain" "apim" {

`proxy` is deprecated and will be renamed to `gateway` in version 3.0 of the
AzureRM provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @rafaelherik, Action: `pull_request`*